base/DataProcessors/бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСтатейОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикВыдачиТраншей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаТранша</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТранша</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцПервогоПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПериодовВыплат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМесяцаПервогоПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходДоход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РасходДоход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставляющаяПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СоставляющиеПлатежейПоФинДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадолженностьПоОсновномуДолгу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвободныйОстатокЛимитаВозобновляемый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвободныйОстатокЛимитаНЕВозобновляемый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

base/InformationRegisters/ДанныеПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПроизводственногоКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_РасходДоход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РасходДоход</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расходование</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ТипыСтатейОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСтатейОборотов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БДДС</Name>
					<Comment>Статья БДДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БДР</Name>
					<Comment>Статья БДР</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НефинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочая статья</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/DataProcessors/бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Получим настройки программы.
	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(Параметры.Документ) Тогда
		СтруктураПараметров.Вставить("Организация", Параметры.Документ.Организация);
		СтруктураПараметров.Вставить("ЦФО"		  , Параметры.Документ.ЦФО);
		ДатаНастроек = Параметры.Документ.Дата;
	Иначе
		Если ТипЗнч(Параметры.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			ИЛИ  ТипЗнч(Параметры.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
			СтруктураПараметров.Вставить("Организация", Параметры.ДоговорКонтрагента.Организация);
			СтруктураПараметров.Вставить("ЦФО"		  , Параметры.ДоговорКонтрагента.бит_ЦФО);
		КонецЕсли;
		ДатаНастроек = ТекущаяДатаСеанса();
	КонецЕсли;

	Объект.Календарь = бит_НастройкиПрограммы.Календарь(СтруктураПараметров, ДатаНастроек);
	
	Объект.ДоговорКонтрагента= Параметры.ДоговорКонтрагента;
	Объект.НаправлениеДДС	 = Параметры.НаправлениеДДС;
	Объект.ВидГрафика		 = Параметры.ВидГрафика;
	Объект.Документ			 = Параметры.Документ;
	
	Если Параметры.Свойство("СтруктураТаблиц") Тогда
		Если Параметры.СтруктураТаблиц.Свойство("ГрафикВыдачиТраншей") Тогда
			ТаблицаВыдачиТраншей = бит_ОбщегоНазначения.РаспаковатьТаблицуИзМассива(Параметры.СтруктураТаблиц.ГрафикВыдачиТраншей,
																					Параметры.СтруктураТаблиц.ГрафикВыдачиТраншей_Колонки);
			
			Для Каждого ТекущаяСтрока Из ТаблицаВыдачиТраншей Цикл
				НоваяСтрока = Объект.ГрафикВыдачиТраншей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);				
				НоваяСтрока.ИД = Строка(Новый УникальныйИдентификатор);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ОтобразитьГрафикВыдачиТраншей = Истина;
	ОтобразитьПараметры			  = Истина;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Возможно с параметрами передали договор.
	ПриИзмененииДоговора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	// Заполним способ расчета из договора.
	ПриИзмененииДоговора();
	
	КоллекцияСоставляющих = ДеревоСоставляющих.ПолучитьЭлементы();
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоСоставляющих,КоллекцияСоставляющих,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	КоллекцияСоставляющих = ДеревоСоставляющих.ПолучитьЭлементы();
	
	КоллекцияСоставляющих.Очистить();
	
	ЗаполнитьСоставляющиеПлатежа(Объект.СпособРасчета);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоСоставляющих,КоллекцияСоставляющих,Истина);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСоставляющих

&НаКлиенте
Процедура ДеревоСоставляющихЗначениеПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСоставляющих.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипПлатежаПоФинДоговору = мКэшЗначений.ТипПлатежаОсновнойДолг
		И ТекущиеДанные.Параметр = мКэшЗначений.ПараметрПериодичность Тогда
		
		мКэшЗначений.ПериодичностьОсновногоДолга = ТекущиеДанные.ЗначениеПараметра;
		
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
	ТекущиеДанные.ПараметрМодифицирован = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСоставляющихЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоСоставляющих.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтатьяОборотовБДДСПоступление"	, мКэшЗначений.СтатьяОборотовБДДСПоступление);
	СтруктураПараметров.Вставить("СтатьяОборотовБДДСРасходование"	, мКэшЗначений.СтатьяОборотовБДДСРасходование);
	СтруктураПараметров.Вставить("СтатьяОборотовБДРПоступление"		, мКэшЗначений.СтатьяОборотовБДРПоступление);
	СтруктураПараметров.Вставить("СтатьяОборотовБДРРасходование"	, мКэшЗначений.СтатьяОборотовБДРРасходование);
	СтруктураПараметров.Вставить("Перечисления"						, мКэшЗначений.Перечисления);
	СтруктураПараметров.Вставить("ИмяРеквизитаЗначение"				, "ЗначениеПараметра");
	СтруктураПараметров.Вставить("ИмяРеквизитаТипПлатежа"			, "ТипПлатежаПоФинДоговору");
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораЗначенияПараметраСоставляющейПлатежа(ЭтотОбъект, Элемент, ТекущиеДанные, СтруктураПараметров, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоСоставляющихЗначениеПараметраОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоСоставляющих.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бит_РаботаСДиалогамиКлиент.ОчисткаЗначенияПараметраСоставляющейПлатежа(ТекущиеДанные, "Параметр", "ЗначениеПараметра", СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикВыдачиТраншей

&НаКлиенте
Процедура ГрафикВыдачиТраншейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИД = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыдачиТраншейДатаТраншаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.МесяцПервогоПлатежа = ДобавитьМесяц(ТекущиеДанные.ДатаТранша, 1);
	
	ПериодичностьПланирования = мКэшЗначений.Перечисления.бит_ПериодичностьПланирования.Месяц;
	
	ТекущиеДанные.ПредставлениеМесяцаПервогоПлатежа = бит_РаботаСДиалогамиКлиентСервер.СформироватьПредставлениеПериода(ТекущиеДанные.МесяцПервогоПлатежа, ПериодичностьПланирования);
	
	РассчитатьКоличествоПериодовВыплат(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыдачиТраншейДатаПогашенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьКоличествоПериодовВыплат(ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ГрафикВыдачиТраншейПредставлениеМесяцаПервогоПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");  
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("НачалоПериода",	ТекущиеДанные.МесяцПервогоПлатежа);
	ПараметрыВыбора.Вставить("КонецПериода",	ТекущиеДанные.МесяцПервогоПлатежа);
	ПараметрыВыбора.Вставить("ВидПериода",		ВидПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", ПараметрыВыбора, , , , , ОписаниеОповещения);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыбратьПериодЗавершение".
//
// Параметры:
//  РезультатВыбора	- Структура.
//  ДопПараметры	- Структура.
//
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.МесяцПервогоПлатежа = РезультатВыбора.НачалоПериода;
	
	// Рассчитаем количество периодов выплат.																
	ПериодичностьПланирования = мКэшЗначений.Перечисления.бит_ПериодичностьПланирования.Месяц;
	РассчитатьКоличествоПериодовВыплат(ТекущиеДанные);
	ТекущиеДанные.ПредставлениеМесяцаПервогоПлатежа = бит_РаботаСДиалогамиКлиентСервер.СформироватьПредставлениеПериода(ТекущиеДанные.МесяцПервогоПлатежа, ПериодичностьПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыдачиТраншейПредставлениеМесяцаПервогоПлатежаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыдачиТраншейПредставлениеМесяцаПервогоПлатежаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикВыдачиТраншей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПредставлениеМесяцаПервогоПлатежа) Тогда
		
		ПериодичностьПланирования = мКэшЗначений.Перечисления.бит_ПериодичностьПланирования.Месяц;
		
		ТекущиеДанные.МесяцПервогоПлатежа = бит_ОбщегоНазначенияКлиентСервер.ПолучитьПериодПоСдвигу(ТекущиеДанные.МесяцПервогоПлатежа
																					, Направление
																					, ПериодичностьПланирования);
																					
		ТекущиеДанные.ПредставлениеМесяцаПервогоПлатежа = бит_РаботаСДиалогамиКлиентСервер.СформироватьПредставлениеПериода(ТекущиеДанные.МесяцПервогоПлатежа, ПериодичностьПланирования);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикПлатежей

&НаКлиенте
Процедура ГрафикПлатежейПриАктивизацииЯчейки(Элемент)
	
	РассчитатьРезультатПоВыделеннымСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейПослеУдаления(Элемент)
	
	ЗаполнитьИтогиПоГрафику();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейПериодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ЭтоВыходной = НЕ ЭтоРабочийДень(ТекущиеДанные.Период, Объект.Календарь);
	
	ТекущиеДанные.ЭтоЗапрещенныйПериод = ТекущиеДанные.ДатаПогашения < ТекущиеДанные.Период;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСтатьяОборотовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ГрафикПлатежей.ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Укажем параметры отбора статьи оборотов.
	РасходДоход = ТекущаяСтрока.РасходДоход;
	Если ЗначениеЗаполнено(Объект.ВидГрафика) Тогда
		ТипСтатьи = Объект.ВидГрафика;
	Иначе
		ТипСтатьи = мКэшЗначений.Перечисления.бит_ТипыСтатейОборотов.БДДС;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("РасходДоход", РасходДоход);
	СтруктураОтбора.Вставить("ТипСтатьи"  , ТипСтатьи);
	
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураОтбора);
		
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСуммаПриИзменении(Элемент)
	
	ЗаполнитьИтогиПоГрафику();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСоставляющаяПлатежаПриИзменении(Элемент)
	
	ЗаполнитьИтогиПоГрафику();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьГрафик(Команда)
	
	СформироватьГрафикПлатежей();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьГрафикВДокумент(Команда)
	
	ПеренестиГрафикиВДокумент("Загрузить");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьГрафикВДокумент(Команда)
	
	ПеренестиГрафикиВДокумент("Добавить");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиНаПредыдущийРабочий(Команда)
	
	ПеренестиПлатежиСПраздничныхДнейВРабочие(0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиНаСледующийРабочий(Команда)
	
	ПеренестиПлатежиСПраздничныхДнейВРабочие(1);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьПараметры(Команда)
	
	ОтобразитьПараметры = НЕ ОтобразитьПараметры;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьГрафикВыдачиТраншей(Команда)
	
	ОтобразитьГрафикВыдачиТраншей = НЕ ОтобразитьГрафикВыдачиТраншей;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьСоставляющиеПлатежа(Команда)
	
	ЗаписатьСоставляющиеПлатежаВДоговор();   
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьГрафикаПлатежей(Команда)
	
	ТабДок = ПечатьГрафикаПлатежей();
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку	   = Ложь;
	
	ТабДок.Показать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура рассчитывает сумму выделенных строк по значениям в текущей колонке в таблице ГрафикПлатежей.
// 
&НаКлиенте
Процедура РассчитатьРезультатПоВыделеннымСтрокам()
	
	Если Элементы.ГрафикПлатежей.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элементы.ГрафикПлатежей.ТекущийЭлемент.Имя;
	
	ИмяПоля = СтрЗаменить(ТекущаяКолонка, "ГрафикПлатежей", "");
	
	ВыделенныеСтроки = Элементы.ГрафикПлатежей.ВыделенныеСтроки;
	
	Результат = 0;
	
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		
		НайденнаяСтрока = Объект.ГрафикПлатежей.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если НайденнаяСтрока = Неопределено ИЛИ НЕ НайденнаяСтрока.Свойство(ИмяПоля) Тогда			
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(НайденнаяСтрока[ИмяПоля]) = Тип("Число") Тогда
			Результат = Результат + НайденнаяСтрока[ИмяПоля];
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатПоВыделеннымСтрокам = Результат;
	
КонецПроцедуры

// Процедура рассчитывает количество периодов выплат по траншу.
// 
// Параметры:
// 	СтрокаТранша - ДанныеФормыЭлементКоллекции ГрафикВыдачиТраншей.
// 
&НаКлиенте
Процедура РассчитатьКоличествоПериодовВыплат(СтрокаТранша)
	
	КоличествоМесяцев = бит_ОбщегоНазначенияКлиентСервер.РазностьДат(СтрокаТранша.МесяцПервогоПлатежа, СтрокаТранша.ДатаПогашения, "МЕСЯЦ") + 1;
	
	// Количество периодов рассчитываем исходя из периодичности основного долга.
	Если мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежегодно Тогда
		КоличествоПериодов = КоличествоМесяцев / 12;
		КоличествоЦелыхПериодов = Цел(КоличествоПериодов);
		ВременныеОстатки = КоличествоМесяцев %12;
		Если ВременныеОстатки = 0 Тогда
			ДопПериод = 0;
		Иначе
			ДопПериод = 1;
		КонецЕсли;
		
		СтрокаТранша.КоличествоПериодовВыплат = КоличествоЦелыхПериодов + ДопПериод;
	ИначеЕсли мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежеквартально Тогда
		КоличествоПериодов = КоличествоМесяцев / 3;
		КоличествоЦелыхПериодов = Цел(КоличествоПериодов);
		ВременныеОстатки = КоличествоМесяцев %3;
		Если ВременныеОстатки = 0 Тогда
			ДопПериод = 0;
		Иначе
			ДопПериод = 1;
		КонецЕсли;
		
		СтрокаТранша.КоличествоПериодовВыплат = КоличествоЦелыхПериодов + ДопПериод;
	ИначеЕсли мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.ПриПогашении Тогда
		СтрокаТранша.КоличествоПериодовВыплат = 1;
	ИначеЕсли мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Единовременно Тогда
		СтрокаТранша.КоличествоПериодовВыплат = 1;	
	Иначе
		СтрокаТранша.КоличествоПериодовВыплат = КоличествоМесяцев;
	КонецЕсли;
	
КонецПроцедуры

// Процедура переносит сформированные график выдачи траншей 
// и график платежей в документ Доп.условия по договору.
// 
// Параметры:
// 	РежимПереноса - строка - (Загрузить, Добавить).
// 
&НаКлиенте
Процедура ПеренестиГрафикиВДокумент(РежимПереноса)
	
	СтруктураТаблиц = Новый Структура;
	
	// Таблицы для загрузки/добавления
	УпаковатьТаблицу(СтруктураТаблиц, "ГрафикПлатежей");
	УпаковатьТаблицу(СтруктураТаблиц, "ГрафикВыдачиТраншей");
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("СтруктураТаблиц"	, СтруктураТаблиц);
	ПараметрыОповещения.Вставить("ВидГрафика"		, Объект.ВидГрафика);
	ПараметрыОповещения.Вставить("РежимДобавления"	, РежимПереноса);
	
	Оповестить("ЗаполнитьФинансовыйГрафик", ПараметрыОповещения);
	
КонецПроцедуры

// Процедура проверяет обязательные параметры для заполнения графика платежей.
// 
&НаСервере
Функция ПроверитьОбязательныеПараметры()
	
	ЕстьОшибки = Ложь;
	
	Если Объект.ГрафикВыдачиТраншей.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не указан график выдачи траншей. Невозможно сформировать график платежей.';
							  |en='Unknown schedule tranche. It is impossible to form a schedule of payments.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);
	КонецЕсли;
	
	// Найдем составляющую с типом основной долг.
	ДеревоПараметров = РеквизитФормыВЗначение("ДеревоСоставляющих");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ТипПлатежаПоФинДоговору", мКэшЗначений.ТипПлатежаОсновнойДолг);
	
	НайденныеСтроки = ДеревоПараметров.Строки.НайтиСтроки(СтруктураОтбора);	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Отсутствует составляющая платежа с типом ""Основной долг"". Невозможно сформировать график платежей.';
							  |en='No component of the payments to the type of ""Primary duty"". It is impossible to form a schedule of payments.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);
	КонецЕсли;	
	
	ПараметрыОснДолга = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПараметрыСоставляющей(мКэшЗначений.ТипПлатежаОсновнойДолг, ДеревоПараметров);
	
	// Проверим график выдачи траншей
	Для Каждого ТекущийТранш Из Объект.ГрафикВыдачиТраншей Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущийТранш.ДатаТранша) Тогда
			ТекстСообщения = НСтр("ru='В строке №%1 графика выдачи траншей: Не указана дата транша.';
								  |en='The line №%1 Graph Tranche: Not Specified tranche date.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийТранш.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);
		КонецЕсли;
		
		Если ТекущийТранш.ДатаТранша > ТекущийТранш.ДатаПогашения Тогда
			ТекстСообщения = НСтр("ru='В строке №%1 графика выдачи траншей: Дата выдачи транша превышает дату погашения транша.';
								  |en='In line №%1 graph tranche: issuing tranche date exceeds the date of redemption tranche.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийТранш.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);
		КонецЕсли;
		
		Если ТекущийТранш.КоличествоПериодовВыплат = 0 Тогда
			ТекстСообщения = НСтр("ru='В строке №%1 графика выдачи траншей: Количество периодов выплат не может быть равно 0.';
								  |en='In line №%1 graph tranche: Number of payment periods can not be 0.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийТранш.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);
		КонецЕсли;
		
		ПериодОкончанияВыплат = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПолучитьПериодОкончанияВыплатПоТраншу(ПараметрыОснДолга, ТекущийТранш);
		
		Если ТекущийТранш.ДатаПогашения < ПериодОкончанияВыплат Тогда
			ТекстСообщения = НСтр("ru='В строке №%1 графика выдачи траншей: При указанном количестве периодов выплат даты платежей будут превышать дату погашения.';
								  |en='In line №%1 graph tranche: When a specified amount of payment periods payment date will exceed maturity.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийТранш.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверим составляющие платежа
	КоллекцияСоставляющих = ДеревоСоставляющих.ПолучитьЭлементы();
	
	Для Каждого ТекущаяСоставляющая Из КоллекцияСоставляющих Цикл
		НаборПараметров = ТекущаяСоставляющая.ПолучитьЭлементы();
		
		Для Каждого ТекущийПараметр Из НаборПараметров Цикл
			Если ТекущийПараметр.Обязательный И НЕ ЗначениеЗаполнено(ТекущийПараметр.ЗначениеПараметра) Тогда				
				ТекстСообщения = НСтр("ru='Для составляющей платежа ""%1"" не указано значение обязательного параметра ""%2"".';
									  |en='For payment component ""%1"" is not set to the required parameter ""%2.""'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущаяСоставляющая.Группировка, ТекущийПараметр.Параметр);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ЕстьОшибки);				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЕстьОшибки;
	
КонецФункции

// Процедура заполняет график платежей.
// 
// Параметры:
// 	нет
// 
&НаСервере
Процедура СформироватьГрафикПлатежей()
	
	// Проверим обязательные параметры.
	ЕстьОшибки = ПроверитьОбязательныеПараметры();
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ГрафикПлатежей.Очистить();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	СтруктураПараметров.Вставить("СуммаДоговора"	 , Объект.СуммаДоговора);
	СтруктураПараметров.Вставить("НаправлениеДДС"	 , Объект.НаправлениеДДС);
	СтруктураПараметров.Вставить("ВидГрафика"		 , Объект.ВидГрафика);
	
	ДеревоПараметров = РеквизитФормыВЗначение("ДеревоСоставляющих");
	
	ТаблицаПериодов = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.СформироватьГрафикПлатежей(Объект.ГрафикВыдачиТраншей, ДеревоПараметров, СтруктураПараметров);
	
	// Выведем на форму получившийся график
	Для Каждого ТекущаяСтрока Из ТаблицаПериодов Цикл
		
		Если ТекущаяСтрока.ОтказОтВвода Тогда
			Продолжить;
		КонецЕсли;
		
		Если Объект.ВидГрафика = мКэшЗначений.Перечисления.бит_ТипыСтатейОборотов.БДР
			И (Объект.НаправлениеДДС = "Получение" ИЛИ НЕ ЗначениеЗаполнено(Объект.НаправлениеДДС))
			И ТекущаяСтрока.Направление = мКэшЗначений.Перечисления.бит_РасходДоход.Поступление Тогда
			
			Продолжить;
			
		ИначеЕсли Объект.ВидГрафика = мКэшЗначений.Перечисления.бит_ТипыСтатейОборотов.БДР
			И Объект.НаправлениеДДС = "Выдача"
			И ТекущаяСтрока.Направление = мКэшЗначений.Перечисления.бит_РасходДоход.Расходование Тогда
			
			Продолжить;
			
		ИначеЕсли Объект.ВидГрафика = мКэшЗначений.Перечисления.бит_ТипыСтатейОборотов.БДР
			И ТекущаяСтрока.СоставляющаяПлатежа.ТипПлатежаПоФинДоговору = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
		НоваяСтрока.РасходДоход = ТекущаяСтрока.Направление;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		Если НоваяСтрока.ДатаПогашения < НоваяСтрока.Период Тогда
			НоваяСтрока.ЭтоЗапрещенныйПериод = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьИтогиПоГрафику();
	
	ПометитьПлатежиПопадающиеНаВыходной();
	
КонецПроцедуры

// Процедура заполняет таблицу с итогами по графику платежей.
// 
// Параметры:
// 	нет
// 
&НаСервере
Процедура ЗаполнитьИтогиПоГрафику()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("График", Объект.ГрафикПлатежей.Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	График.РасходДоход,
	|	График.СоставляющаяПлатежа,
	|	График.Сумма
	|ПОМЕСТИТЬ График
	|ИЗ
	|	&График КАК График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	График.РасходДоход КАК Направление,
	|	График.СоставляющаяПлатежа,
	|	СУММА(График.Сумма) КАК Сумма
	|ИЗ
	|	График КАК График
	|
	|СГРУППИРОВАТЬ ПО
	|	График.РасходДоход,
	|	График.СоставляющаяПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Направление
	|ИТОГИ ПО
	|	Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ График";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭлементыИтогов = ИтогоПоГрафику.ПолучитьЭлементы();
	ЭлементыИтогов.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НовыйИтог = ЭлементыИтогов.Добавить();
		НовыйИтог.Группировка = Выборка.Направление;
		НовыйИтог.Сумма		  = Выборка.Сумма;
		
		ДеталиИтога = НовыйИтог.ПолучитьЭлементы();
		
		ВыборкаДетали = Выборка.Выбрать();
		КоличествоДеталей = ВыборкаДетали.Количество();
		
		Пока ВыборкаДетали.Следующий() Цикл
			Если КоличествоДеталей = 1
				И НЕ ЗначениеЗаполнено(ВыборкаДетали.СоставляющаяПлатежа) Тогда
				Прервать;
			КонецЕсли;
			НоваяДеталь = ДеталиИтога.Добавить();
			НоваяДеталь.Группировка = ВыборкаДетали.СоставляющаяПлатежа;
			НоваяДеталь.Сумма		= ВыборкаДетали.Сумма;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
// Параметры:
//  КэшированныеЗначения - Структура.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_ПериодичностьВыплатПоФинансовымДоговорам" , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам));
	КэшПеречисления.Вставить("бит_ТипыПроцентныхСтавокПоФинансовымДоговорам", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыПроцентныхСтавокПоФинансовымДоговорам));
	КэшПеречисления.Вставить("бит_ПериодичностьПланирования", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ПериодичностьПланирования));
	КэшПеречисления.Вставить("бит_РасходДоход"				, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_РасходДоход));
	КэшПеречисления.Вставить("бит_ТипыСтатейОборотов"		, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыСтатейОборотов));
	КэшПеречисления.Вставить("бит_АлгоритмыРасчетовПоФинДоговорам"	, бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_АлгоритмыРасчетовПоФинДоговорам));
	КэшПеречисления.Вставить("бит_ТипыПлатежейПоФинансовымДоговорам", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам));
	КэшПеречисления.Вставить("бит_КонтекстыВыполненияПользовательскихФункций", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_КонтекстыВыполненияПользовательскихФункций));
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);

	КэшированныеЗначения.Вставить("ТипПлатежаОсновнойДолг", Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг);
	КэшированныеЗначения.Вставить("ТипПлатежаПроценты"	  , Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты);
	КэшированныеЗначения.Вставить("ПараметрПериодичность" , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.Периодичность);
	
	КэшированныеЗначения.Вставить("ПериодичностьОсновногоДолга" , Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежемесячно);
	
	КэшированныеЗначения.Вставить("ПустаяСтатьяОборотов", Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	
	КэшированныеЗначения.Вставить("СтатьяОборотовБДДСПоступление"  , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДДСПоступление);
	КэшированныеЗначения.Вставить("СтатьяОборотовБДДСРасходование" , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДДСРасходование);
	КэшированныеЗначения.Вставить("СтатьяОборотовБДРПоступление"   , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДРПоступление);
	КэшированныеЗначения.Вставить("СтатьяОборотовБДРРасходование"  , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДРРасходование);

	КэшированныеЗначения.Вставить("ЭтоБП", бит_ОбщегоНазначения.ЭтоСемействоБП());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура подготавливает для заполнения составляющие и параметры платежа.
// 
// Параметры:
// 	ВладелецСоставляющих - (СправочникСсылка.ДоговорКонтрагента)  - уточняет местоположение составляющих и параметров
// 						   (СправочникСсылка.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам).
// 
&НаСервере
Процедура ЗаполнитьСоставляющиеПлатежа(ИсточникЗаполнения)
	
    Дерево = бит_Договоры.ДанныеПараметровФинДоговоров(ИсточникЗаполнения);
	
	ЗаполнитьДеревоСоставляющих(Дерево, ДеревоСоставляющих.ПолучитьЭлементы(), мКэшЗначений);
	
КонецПроцедуры

// Процедура заполняет дерево составляющих. Выполняется рекурсивно.
// 
// Параметры:
// 	ДеревоИсточник - ДеревоЗначений - дерево на основании которого формируем ДеревоПриемник.
// 	ДеревоПриемник - ДанныеФормыКоллекцияЭлементовДерева - ДеревоСоставляющих.
// 	КэшЗначений - структура.
// 
&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоСоставляющих(ДеревоИсточник, ДеревоПриемник, КэшЗначений)
	
	Для Каждого ТекущаяСтрока Из ДеревоИсточник.Строки Цикл
		НоваяСтрока = ДеревоПриемник.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.ТипПлатежаПоФинДоговору = ТекущаяСтрока.ТипПлатежа;
		НоваяСтрока.ЗначениеПараметра		= ТекущаяСтрока.Значение;
		
		// Запомним периодичность основного долга
		Если НоваяСтрока.ТипПлатежаПоФинДоговору = КэшЗначений.ТипПлатежаОсновнойДолг
			И НоваяСтрока.Параметр = КэшЗначений.ПараметрПериодичность Тогда
			
			КэшЗначений.ПериодичностьОсновногоДолга = НоваяСтрока.ЗначениеПараметра;
			
		КонецЕсли;
		
		ЗаполнитьДеревоСоставляющих(ТекущаяСтрока, НоваяСтрока.ПолучитьЭлементы(), КэшЗначений);
	КонецЦикла;
	
КонецПроцедуры

// Процедура управляет видимостью/доступностью элементов формы.
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	// Укажем в каких единицах времени измеряется период выплаты по траншам.
	Если мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежегодно Тогда
		Элементы.ГрафикВыдачиТраншейКоличествоПериодовВыплат.Заголовок = НСтр("ru = 'Количество периодов выплат (год)'; 
																			  |en = 'Number of pay periods (year)'");
	ИначеЕсли мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежеквартально Тогда
		Элементы.ГрафикВыдачиТраншейКоличествоПериодовВыплат.Заголовок = НСтр("ru = 'Количество периодов выплат (квартал)'; 
																			  |en = 'Number of pay periods (quarter)'");
	ИначеЕсли мКэшЗначений.ПериодичностьОсновногоДолга = мКэшЗначений.Перечисления.бит_ПериодичностьВыплатПоФинансовымДоговорам.Ежемесячно Тогда
		Элементы.ГрафикВыдачиТраншейКоличествоПериодовВыплат.Заголовок = НСтр("ru = 'Количество периодов выплат (месяц)'; 
																			  |en = 'Number of pay periods (month)'");
	Иначе
		Элементы.ГрафикВыдачиТраншейКоличествоПериодовВыплат.Заголовок = НСтр("ru = 'Количество периодов выплат'; 
																			  |en = 'Number of pay periods'");	
	КонецЕсли;
	
	Элементы.ВидГрафика.ТолькоПросмотр		   = ЗначениеЗаполнено(Объект.Документ);
	Элементы.ДоговорКонтрагента.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Документ);
	
	Элементы.СуммаДоговора.ТолькоПросмотр	 = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	Элементы.СпособРасчета.ТолькоПросмотр	 = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	
	Элементы.ГрафикПлатежейГруппаДействияСГрафиком.Видимость = ЗначениеЗаполнено(Объект.Документ);
	
	Элементы.КомандаЗаписатьСоставляющиеПлатежа.Видимость = ЗначениеЗаполнено(Объект.ДоговорКонтрагента);
	
	Элементы.ГруппаПраво.Видимость 				 = ОтобразитьПараметры;
	Элементы.ГруппаГрафикВыдачиТраншей.Видимость = ОтобразитьГрафикВыдачиТраншей;
	
	Элементы.ФормаКомандаОтобразитьПараметры.Пометка			= ОтобразитьПараметры;
	Элементы.ФормаКомандаОтобразитьГрафикВыдачиТраншей.Пометка 	= ОтобразитьГрафикВыдачиТраншей;
	
	Элементы.ГруппаКалендарь.Видимость = мКэшЗначений.ЭтоБП;
	
КонецПроцедуры

// Процедура преобразует реквизит управляемой формы ДанныеФормыКоллекция в массив структур.
// 
// Параметры:
//  СтрТаблиц  - Структура
//  ИмяТаблицы - Строка
// 
&НаСервере
Процедура УпаковатьТаблицу(СтрТаблиц,ИмяТаблицы)
	
	МассивРеквизитов = Объект[ИмяТаблицы].Выгрузить().Колонки;
	
	ИменаРеквизитов = Новый Структура;
	
	Для каждого Реквизит Из МассивРеквизитов Цикл		
		ИменаРеквизитов.Вставить(Реквизит.Имя, Реквизит.ТипЗначения);		
	КонецЦикла;
	
	СтрТаблиц.Вставить(ИмяТаблицы, бит_ОбщегоНазначения.УпаковатьДанныеФормыКоллекция(Объект[ИмяТаблицы], ИменаРеквизитов));
	СтрТаблиц.Вставить(ИмяТаблицы+"_Колонки", ИменаРеквизитов);
	
КонецПроцедуры

// Процедура инициирует запись составляющих платежа и их параметров отображенных на форме
// 	в договор (проект договора).
// 
// Параметры:
// 	нет.
// 
&НаСервере
Процедура ЗаписатьСоставляющиеПлатежаВДоговор()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоПараметров = РеквизитФормыВЗначение("ДеревоСоставляющих");
	
	ДеревоПараметров.Колонки.ЗначениеПараметра.Имя = "Значение";
	
	ДействиеВыполнено = бит_Договоры.ЗаписатьПараметрыФинансовогоДоговора(Объект.ДоговорКонтрагента, ДеревоПараметров);
	
	ДеревоПараметров.Колонки.Значение.Имя = "ЗначениеПараметра";
	
	// Снимем флаг модифицированности у параметров.
	Если ДействиеВыполнено Тогда
		
		КоллекцияСоставляющих = ДеревоСоставляющих.ПолучитьЭлементы();
		
		Для Каждого ЭлементКоллекции Из КоллекцияСоставляющих Цикл
			
			ПараметрыСоставляющей = ЭлементКоллекции.ПолучитьЭлементы();
			
			Для Каждого ТекущийПараметр Из ПараметрыСоставляющей Цикл
				
				ТекущийПараметр.ПараметрМодифицирован = Ложь;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция подготавливает параметры и инициирует формирование табличного документа передаваемого на печать.
// 
// Параметры:
// 	нет
// 
&НаСервере
Функция ПечатьГрафикаПлатежей()
	
	ТабДок = Неопределено;
	
	СуммаДолга				 = Объект.ГрафикВыдачиТраншей.Итог("СуммаТранша");
	КоличествоПериодовВыплат = Объект.ГрафикВыдачиТраншей.Итог("КоличествоПериодовВыплат");
	
	Дерево = РеквизитФормыВЗначение("ДеревоСоставляющих");
	
	ПараметрыПроцентов = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПараметрыСоставляющей(Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты, Дерево);
	Если ПараметрыПроцентов.ТипПроцентнойСтавки = Перечисления.бит_ТипыПроцентныхСтавокПоФинансовымДоговорам.Фиксированная Тогда
		ПроцентнаяСтавка = ПараметрыПроцентов.ПроцентнаяСтавка;
	Иначе
		ПроцентнаяСтавка = 0;
	КонецЕсли;
	
	ТаблицаГрафика = Объект.ГрафикПлатежей.Выгрузить();
	
	Структура = Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.ПолучитьРезультатЗапросаПоГрафикуПлатежей(ТаблицаГрафика);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СуммаДолга"				, СуммаДолга);
	СтруктураПараметров.Вставить("КоличествоПериодовВыплат"	, КоличествоПериодовВыплат);
	СтруктураПараметров.Вставить("ПроцентнаяСтавка"			, ПроцентнаяСтавка);
	СтруктураПараметров.Вставить("РезультатЗапроса"			, Структура.РезультатЗапроса);
	СтруктураПараметров.Вставить("СтруктураДопКолонок"		, Структура.СтруктураДопКолонок);
	
	Обработки.бит_ФормированиеГрафиковПлатежейПоФинансовымДоговорам.Печать(СтруктураПараметров, "ГрафикПлатежей", ТабДок);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииДоговора()
	
	Если ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") 
		ИЛИ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов") Тогда
		Объект.СпособРасчета = Объект.ДоговорКонтрагента.бит_СпособРасчетаФинПлатежей;
		Объект.СуммаДоговора = Объект.ДоговорКонтрагента.бит_СуммаДоговора;
	КонецЕсли;
	
	КоллекцияСоставляющих = ДеревоСоставляющих.ПолучитьЭлементы();
	
	КоллекцияСоставляющих.Очистить();
	
	ЗаполнитьСоставляющиеПлатежа(Объект.ДоговорКонтрагента);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

// Процедура переносит даты выплат с выходных дней на рабочие дни.
// 
// Параметры:
// 	РежимПереноса - число(0, 1) - определяет направление переноса.
// 
&НаСервере
Процедура ПеренестиПлатежиСПраздничныхДнейВРабочие(РежимПереноса)
	
	Если мКэшЗначений.ЭтоБП Тогда
		// Проверку выполняем только для БП, т.к. в УПП нет соответствующего справочника.
		Если НЕ ЗначениеЗаполнено(Объект.Календарь) Тогда			
			ТекстСообщения = НСтр("ru='Не указан производственный календарь.';
						  	      |en='No production calendar specified.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, "Объект.Календарь");			
			Возврат;			
		КонецЕсли;		
	КонецЕсли;
	
	ТаблицаПлатежей = Объект.ГрафикПлатежей.Выгрузить();
	
	ТаблицаПлатежей.Сортировать("Период");
	
	МинимальнаяДата  = Дата(1,1,1);
	МаксимальнаяДата = Дата(2999,1,1);
	
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		МинимальнаяДата  = ДобавитьМесяц(ТаблицаПлатежей[0].Период, -1);
		МаксимальнаяДата = ДобавитьМесяц(ТаблицаПлатежей[ТаблицаПлатежей.Количество()-1].Период, 1);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	РабочиеДни = Новый Массив;
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос.УстановитьПараметр("ТаблицаПлатежей" , ТаблицаПлатежей);
	Запрос.УстановитьПараметр("Календарь"		, Объект.Календарь);
	Запрос.УстановитьПараметр("РабочиеДни"	    , РабочиеДни);
	Запрос.УстановитьПараметр("МинимальнаяДата" , МинимальнаяДата);
	Запрос.УстановитьПараметр("МаксимальнаяДата", МаксимальнаяДата);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПлатежей.Период
	|ПОМЕСТИТЬ ТаблицаПлатежей
	|ИЗ
	|	&ТаблицаПлатежей КАК ТаблицаПлатежей
	|;
	|";
	
	ТекстДанныеГрафика = 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаКалендаря,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ПОМЕСТИТЬ ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
	|	И ДанныеПроизводственногоКалендаря.ВидДня В(&РабочиеДни)
	|	И ДанныеПроизводственногоКалендаря.Дата >= &МинимальнаяДата
	|	И ДанныеПроизводственногоКалендаря.Дата <= &МаксимальнаяДата
	|;
	|";
	
	ТекстЗапроса = ТекстЗапроса + ТекстДанныеГрафика;
	ТекстЗапроса = ТекстЗапроса +
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПлатежей.Период,
	|	ЕстьNULL(МАКСИМУМ(ПроизводственныйКалендарьПредРабочий.ДатаКалендаря),ТаблицаПлатежей.Период) КАК ПредыдущийРабочий,
	|	ЕстьNULL(МИНИМУМ(ПроизводственныйКалендарьСледРабочий.ДатаКалендаря),ТаблицаПлатежей.Период) КАК СледующийРабочий
	|ИЗ
	|	ТаблицаПлатежей КАК ТаблицаПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизводственныйКалендарь КАК ПроизводственныйКалендарьПредРабочий
	|		ПО ТаблицаПлатежей.Период >= ПроизводственныйКалендарьПредРабочий.ДатаКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизводственныйКалендарь КАК ПроизводственныйКалендарьСледРабочий
	|		ПО ТаблицаПлатежей.Период <= ПроизводственныйКалендарьСледРабочий.ДатаКалендаря
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПлатежей.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПлатежей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПроизводственныйКалендарь";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	ТаблицаПереносовДат = Результат.Выгрузить();
	
	Для Каждого ТекущаяСтрока Из Объект.ГрафикПлатежей Цикл
		
		ДанныеОПереносе = ТаблицаПереносовДат.Найти(ТекущаяСтрока.Период, "Период");
		
		Если РежимПереноса = 0 Тогда
			ТекущаяСтрока.Период = ДанныеОПереносе.ПредыдущийРабочий;
		Иначе
			ТекущаяСтрока.Период = ДанныеОПереносе.СледующийРабочий;
		КонецЕсли;
		
	КонецЦикла;
	
	ПометитьПлатежиПопадающиеНаВыходной();
	
КонецПроцедуры

// Процедура устанавливает признак выходного дня для платежей, которые в соответствии
// 	с производственным календарем попадают на выходные дни.
// 
// Параметры:
// 	нет.
// 
&НаСервере
Процедура ПометитьПлатежиПопадающиеНаВыходной()
	
	ТаблицаПлатежей = Объект.ГрафикПлатежей.Выгрузить();
	
	ТаблицаПлатежей.Сортировать("Период");
	
	МинимальнаяДата  = Дата(1,1,1);
	МаксимальнаяДата = Дата(2999,1,1);
	
	Если ТаблицаПлатежей.Количество() > 0 Тогда
		МинимальнаяДата  = ДобавитьМесяц(ТаблицаПлатежей[0].Период, -1);
		МаксимальнаяДата = ДобавитьМесяц(ТаблицаПлатежей[ТаблицаПлатежей.Количество()-1].Период, 1);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	РабочиеДни = Новый Массив;
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос.УстановитьПараметр("ТаблицаПлатежей" , ТаблицаПлатежей);
	Запрос.УстановитьПараметр("Календарь"		, Объект.Календарь);
	Запрос.УстановитьПараметр("РабочиеДни"	    , РабочиеДни);
	Запрос.УстановитьПараметр("МинимальнаяДата" , МинимальнаяДата);
	Запрос.УстановитьПараметр("МаксимальнаяДата", МаксимальнаяДата);
	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаПлатежей.Период
	|ПОМЕСТИТЬ ТаблицаПлатежей
	|ИЗ
	|	&ТаблицаПлатежей КАК ТаблицаПлатежей
	|;
	|";
	
	ТекстДанныеГрафика = 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаКалендаря,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ПОМЕСТИТЬ ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
	|	И (НЕ ДанныеПроизводственногоКалендаря.ВидДня В (&РабочиеДни))
	|	И ДанныеПроизводственногоКалендаря.Дата >= &МинимальнаяДата
	|	И ДанныеПроизводственногоКалендаря.Дата <= &МаксимальнаяДата
	|;
	|";
	
	ТекстЗапроса = ТекстЗапроса + ТекстДанныеГрафика;
	ТекстЗапроса = ТекстЗапроса +
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПлатежей.Период,
	|	ПроизводственныйКалендарь.ВидДня,
	|	ПроизводственныйКалендарь.ДатаКалендаря
	|ИЗ
	|	ТаблицаПлатежей КАК ТаблицаПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|		ПО ТаблицаПлатежей.Период = ПроизводственныйКалендарь.ДатаКалендаря
	|ГДЕ
	|	(НЕ ПроизводственныйКалендарь.ДатаКалендаря ЕСТЬ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПлатежей.Период,
	|	ПроизводственныйКалендарь.ВидДня,
	|	ПроизводственныйКалендарь.ДатаКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаПлатежей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПроизводственныйКалендарь";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	// Снимем признак выходного дня у строк
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоВыходной", Истина);
	
	МассивСтрок = Объект.ГрафикПлатежей.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого ТекущаяСтрока Из МассивСтрок Цикл 
		
		ТекущаяСтрока.ЭтоВыходной = Ложь;
		
	КонецЦикла;
	
	// Установим признак выходного дня
	Пока Выборка.Следующий() Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Период", Выборка.Период);
		
		МассивСтрок = Объект.ГрафикПлатежей.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого ТекущаяСтрока Из МассивСтрок Цикл 
			
			ТекущаяСтрока.ЭтоВыходной = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция проверяет переданную дату является ли она рабочим днем.
// 
// Параметры:
// 	ДатаКалендаря - дата - дата, которую необходимо проверить.
// 
// Возвращаемое значение:
// 	ЭтоРабочийДень - булево - Истина - переданная дата относится к рабочим дням.
// 
&НаСервереБезКонтекста
Функция ЭтоРабочийДень(ДатаКалендаря, Календарь)
	
	ЭтоБП = бит_ОбщегоНазначения.ЭтоСемействоБП();
	
	Если ЭтоБП Тогда
		// Проверку выполняем только для БП, т.к. в УПП нет соответствующего справочника.
		Если НЕ ЗначениеЗаполнено(Календарь) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	РабочиеДни = Новый Массив;
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	РабочиеДни.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос.УстановитьПараметр("РабочиеДни"	 , РабочиеДни);
	Запрос.УстановитьПараметр("Календарь"	 , Календарь);
	Запрос.УстановитьПараметр("ДатаКалендаря", ДатаКалендаря);
	
	Если ЭтоБП Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &Календарь
		|	И ДанныеПроизводственногоКалендаря.Дата = &ДатаКалендаря
		|	И ДанныеПроизводственногоКалендаря.ВидДня В(&РабочиеДни)";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря
		|	И РегламентированныйПроизводственныйКалендарь.ВидДня В(&РабочиеДни)";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ЭтоРабочийДень = Ложь;
	Иначе
		ЭтоРабочийДень = Истина;
	КонецЕсли;
	
	Возврат ЭтоРабочийДень;
	
КонецФункции

#КонецОбласти
